app/controllers/barbecues_controller.rb

  def index
    @barbecues = Barbecue.order(:date)
---
SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC

  def show
    barbecue = Barbecue.find(params[:id])
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 1]]

  def information
    barbecue = Barbecue.find(params[:id])
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 5]]

  def join
    barbecue = Barbecue.find(params[:id])
    user = User.find(current_user.id)
    if barbecue.users.find_by(id: current_user.id) == nil && barbecue.users << user
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
SELECT  "users".* FROM "users" INNER JOIN "participations" ON "users"."id" = "participations"."user_id" WHERE "participations"."barbecue_id" = ? AND "users"."id" = ? LIMIT 1  [["barbecue_id", 3], ["id", 11]]

  def guests
    barbecue = Barbecue.find(params[:id])
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 9]]

  def items
    barbecue = Barbecue.find(params[:id])
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 1]]

  def leave
    barbecue = Barbecue.find(params[:id])
    user = User.find(current_user.id)
    barbecue.users.delete(user)
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]