app/controllers/items_controller.rb

  def create
    barbecue = Barbecue.find(params[:id])
    name = params["name"]
    item = barbecue.items.new(barbecue_id: barbecue.id, name: name)
    if item.save
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "items" ("barbecue_id", "name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["barbecue_id", 5], ["name", "yeah!"], ["user_id", 11], ["created_at", "2015-12-04 16:35:30.586167"], ["updated_at", "2015-12-04 16:35:30.586167"]]