app/controllers/users_controller.rb

  def show
    @barbecues = User.find_by(id: current_user.id).barbecues
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
SELECT "barbecues".* FROM "barbecues" INNER JOIN "participations" ON "barbecues"."id" = "participations"."barbecue_id" WHERE "participations"."user_id" = ?  [["user_id", 11]]